Repository: raheel-dev-ops/Legal_Lawyer_AI
Catalog: legalai-frontend/lib/l10n/app_*.arb
Languages: ur

source: Account
ur: اکاؤنٹ

source: Activity Log
ur: سرگرمی لاگ

source: Age
ur: عمر

source: Age (optional)
ur: عمر (اختیاری)

source: AI Legal Assistant
ur: اے آئی قانونی معاون

# alreadyHaveToken
source: Already have a reset token?
ur: کیا آپ کے پاس ری سیٹ ٹوکن ہے؟

# appTitle
source: Legal AI Lawyer
ur: لیگل اے آئی وکیل

source: Appearance
ur: ظاہری شکل

source: Appearance & Language
ur: ظاہری شکل اور زبان

# askLegalQuestion
source: Ask a legal question
ur: قانونی سوال پوچھیں

source: Back
ur: واپس

source: Basic Information
ur: بنیادی معلومات

source: Bio
ur: تعارف

source: Bookmarks
ur: بک مارکس

# bookmarksSubtitle
source: Saved items and documents
ur: محفوظ آئٹمز اور دستاویزات

source: Brothers
ur: بھائی

source: Browse Library
ur: لائبریری دیکھیں

source: Cancel
ur: منسوخ کریں

source: Category
ur: زمرہ

source: Change Password
ur: پاس ورڈ تبدیل کریں

source: Change photo
ur: تصویر تبدیل کریں

source: Chat
ur: چیٹ

source: Checklist
ur: چیک لسٹ

source: Checklists
ur: چیک لسٹس

source: Choose from gallery
ur: گیلری سے منتخب کریں

source: City
ur: شہر

source: City (optional)
ur: شہر (اختیاری)

source: CNIC
ur: سی این آئی سی

# cnicRequired
source: CNIC is required
ur: سی این آئی سی ضروری ہے

source: Comments
ur: تبصرے

source: Confirm New Password
ur: نئے پاس ورڈ کی تصدیق

source: Confirm Password
ur: پاس ورڈ کی تصدیق

# confirmPasswordRequired
source: Confirm password is required
ur: پاس ورڈ کی تصدیق ضروری ہے

source: Conflict detected
ur: تنازعہ پایا گیا

source: Contact Us
ur: ہم سے رابطہ کریں

source: Conversation deleted
ur: گفتگو حذف ہوگئی

source: Conversations
ur: گفتگوئیں

source: Create
ur: بنائیں

source: Create Account
ur: اکاؤنٹ بنائیں

# createdLabel
source: Created
ur: تخلیق

source: Current Password
ur: موجودہ پاس ورڈ

# currentPasswordRequired
source: Current password is required
ur: موجودہ پاس ورڈ ضروری ہے

source: Dark
ur: ڈارک

source: Delete
ur: حذف کریں

source: Delete draft
ur: ڈرافٹ حذف کریں

# deleteDraftConfirm
source: Are you sure you want to delete this draft?
ur: کیا آپ واقعی یہ ڈرافٹ حذف کرنا چاہتے ہیں؟

source: Drafts
ur: ڈرافٹس

# draftsSubtitle
source: Generate and manage drafts
ur: ڈرافٹس بنائیں اور منظم کریں

source: Edit
ur: ترمیم

source: Edit Profile
ur: پروفائل میں ترمیم

source: Edit Reminder
ur: یاد دہانی میں ترمیم

source: Email
ur: ای میل

source: Email Address
ur: ای میل ایڈریس

# emailInvalid
source: Enter a valid email
ur: درست ای میل درج کریں

# emailRequired
source: Email is required
ur: ای میل ضروری ہے

# emailVerifiedFail
source: Email verification failed
ur: ای میل کی تصدیق ناکام رہی

# emailVerifiedSuccess
source: Email verified
ur: ای میل کی تصدیق ہوگئی

source: Emergency Exit
ur: ہنگامی خروج

# enterEmail
source: Enter your email
ur: اپنا ای میل درج کریں

# enterPassword
source: Enter your password
ur: اپنا پاس ورڈ درج کریں

# errorWithMessage
source: Error: {message}
ur: خرابی: {message}

source: Export canceled
ur: ایکسپورٹ منسوخ ہوگیا

source: Export DOCX
ur: DOCX ایکسپورٹ کریں

source: Export PDF
ur: PDF ایکسپورٹ کریں

source: Export TXT
ur: TXT ایکسپورٹ کریں

source: Family
ur: خاندان

source: Family Details
ur: خاندانی تفصیلات

# fatherCnic
source: Father's CNIC
ur: والد کا سی این آئی سی

# fatherName
source: Father's name
ur: والد کا نام

source: Feedback
ur: فیڈبیک

source: Feedback submitted
ur: فیڈبیک جمع ہوگیا

# findLawyer
source: Find a Lawyer
ur: وکیل تلاش کریں

source: Forgot password?
ur: پاس ورڈ بھول گئے؟

# forgotPasswordSubtitle
source: Don't worry! It happens. Please enter the email address associated with your account to receive a reset link.
ur: پریشان نہ ہوں! ایسا ہو جاتا ہے۔ براہِ کرم اپنے اکاؤنٹ سے وابستہ ای میل ایڈریس درج کریں تاکہ ری سیٹ لنک مل سکے۔

# forgotPasswordTitle
source: Forgot Password?
ur: پاس ورڈ بھول گئے؟

source: Full name
ur: پورا نام

source: Gender
ur: جنس

# genderFemale
source: Female
ur: خاتون

# genderMale
source: Male
ur: مرد

source: Gender (optional)
ur: جنس (اختیاری)

# genderOther
source: Other
ur: دیگر

source: Generate Draft
ur: ڈرافٹ بنائیں

source: Get Started
ur: شروع کریں

source: Guest User
ur: مہمان صارف

source: Help & Support
ur: مدد اور سپورٹ

source: Home
ur: ہوم

# idLabel
source: ID
ur: آئی ڈی

source: Initializing...
ur: شروع کیا جا رہا ہے...

source: Invalid request
ur: غلط درخواست

source: Language
ur: زبان

# languageEnglish
source: English
ur: انگریزی

# languageUrdu
source: Urdu
ur: اردو

source: Lawyer Details
ur: وکیل کی تفصیلات

source: Lawyers
ur: وکلاء

# lawyersSubtitle
source: Find legal experts
ur: قانونی ماہرین تلاش کریں

source: Legal Checklists
ur: قانونی چیک لسٹس

source: Legal Library
ur: قانونی لائبریری

source: Legal Pathway
ur: قانونی راستہ

source: Legal Right
ur: قانونی حق

source: Library
ur: لائبریری

source: Light
ur: لائٹ

source: Log In
ur: لاگ اِن

# loginSubtitle
source: Log in to continue
ur: جاری رکھنے کے لیے لاگ اِن کریں

# loginTitle
source: Welcome Back
ur: دوبارہ خوش آمدید

source: Sign in with Google
ur: گوگل کے ساتھ سائن اِن کریں

# googleSignInNoPassword
source: Password is not required for Google sign-in.
ur: گوگل سائن اِن کے لیے پاس ورڈ درکار نہیں ہے۔

source: Log Out
ur: لاگ آؤٹ

source: Message
ur: پیغام

source: Message sent
ur: پیغام بھیج دیا گیا

# motherCnic
source: Mother's CNIC
ur: والدہ کا سی این آئی سی

# motherName
source: Mother's name
ur: والدہ کا نام

source: My Drafts
ur: میرے ڈرافٹس

source: Name
ur: نام

# nameRequired
source: Name is required
ur: نام ضروری ہے

source: Network error
ur: نیٹ ورک خرابی

source: New Draft
ur: نیا ڈرافٹ

source: New Password
ur: نیا پاس ورڈ

# newPasswordDifferent
source: New password must be different
ur: نیا پاس ورڈ مختلف ہونا چاہیے

# newPasswordRequired
source: New password is required
ur: نیا پاس ورڈ ضروری ہے

source: New Reminder
ur: نئی یاد دہانی

source: Next
ur: اگلا

# noActivity
source: No activity yet
ur: کوئی سرگرمی نہیں

# noBookmarks
source: No bookmarks yet
ur: کوئی بک مارک موجود نہیں

source: No content available
ur: کوئی مواد دستیاب نہیں

# noConversations
source: No conversations yet
ur: کوئی گفتگو موجود نہیں

source: No date selected
ur: کوئی تاریخ منتخب نہیں

# noDrafts
source: No drafts yet
ur: کوئی ڈرافٹ موجود نہیں

source: No fields detected
ur: کوئی فیلڈ نہیں ملی

source: No lawyers available
ur: کوئی وکیل دستیاب نہیں

source: No notes
ur: کوئی نوٹس نہیں

source: No reminders
ur: کوئی یاد دہانی نہیں

source: Not available
ur: دستیاب نہیں

source: Not found
ur: نہیں ملا

source: Notes
ur: نوٹس

# onboardingCardRightsSubtitle
source: Instantly access constitutional rights and legal protections designed for you.
ur: آئینی حقوق اور قانونی تحفظات تک فوری رسائی حاصل کریں جو آپ کے لیے بنائے گئے ہیں۔

# onboardingCardRightsTitle
source: Know Your Rights
ur: اپنے حقوق جانیں

# onboardingFeatureChecklistsSubtitle
source: Step-by-step guides for procedures
ur: عملی کارروائیوں کے لیے مرحلہ وار رہنمائی

# onboardingFeatureChecklistsTitle
source: Legal Checklists
ur: قانونی چیک لسٹس

# onboardingFeatureLawyersSubtitle
source: Find verified legal experts near you
ur: اپنے قریب تصدیق شدہ قانونی ماہرین تلاش کریں

# onboardingFeatureLawyersTitle
source: Lawyers Directory
ur: وکلاء ڈائریکٹری

# onboardingFeatureRemindersSubtitle
source: Never miss a court date or consultation
ur: عدالت کی تاریخ یا مشاورت کبھی نہ چھوڑیں

# onboardingFeatureRemindersTitle
source: Smart Reminders
ur: سمارٹ یاد دہانیاں

# onboardingSubtitle1
source: Navigate the complexities of Pakistani law with ease. Ask questions in Urdu or English and get immediate, confidential guidance.
ur: پاکستانی قانون کی پیچیدگیوں کو آسانی سے سمجھیں۔ اردو یا انگریزی میں سوال کریں اور فوری، خفیہ رہنمائی حاصل کریں۔

# onboardingSubtitle2
source: Empower your legal journey with the right tools and people beside you.
ur: صحیح اوزار اور صحیح لوگوں کے ساتھ اپنے قانونی سفر کو بااختیار بنائیں۔

# onboardingSubtitle3
source: Navigate the legal system with confidence. Explore your rights, generate legal documents, and find clear pathways to justice.
ur: اعتماد کے ساتھ قانونی نظام میں آگے بڑھیں۔ اپنے حقوق جانیں، قانونی دستاویزات تیار کریں، اور انصاف تک واضح راستے پائیں۔

# onboardingTitle1
source: Instant Legal Answers
ur: فوری قانونی جوابات

# onboardingTitle2
source: Connect & Organize
ur: رابطہ کریں اور منظم کریں

# onboardingTitle3
source: Empower Your Rights
ur: اپنے حقوق مضبوط کریں

source: Password
ur: پاس ورڈ

# passwordRequired
source: Password is required
ur: پاس ورڈ ضروری ہے

# passwordResetSuccess
source: Password reset successful
ur: پاس ورڈ کامیابی سے ری سیٹ ہوگیا

# passwordRule
source: Use 8+ characters with a number and a symbol
ur: کم از کم 8 حروف، ایک نمبر اور ایک علامت درکار ہے

# passwordRuleLength
source: At least 8 characters
ur: کم از کم 8 حروف

# passwordRuleNumber
source: Contains a number
ur: ایک نمبر شامل ہو

# passwordRuleSpecial
source: Contains a special character
ur: ایک خصوصی علامت شامل ہو

# passwordStrengthLabel
source: Strength
ur: طاقت

# passwordStrengthMedium
source: Medium
ur: درمیانہ

# passwordStrengthStrong
source: Strong
ur: مضبوط

# passwordStrengthWeak
source: Weak
ur: کمزور

source: Password updated
ur: پاس ورڈ اپ ڈیٹ ہوگیا

source: Passwords do not match
ur: پاس ورڈ مطابقت نہیں رکھتے

source: Pathways
ur: راستے

source: Permission denied
ur: اجازت نہیں

source: Personal
ur: ذاتی

source: Phone
ur: فون

# phoneRequired
source: Phone is required
ur: فون نمبر ضروری ہے

source: Pick date
ur: تاریخ منتخب کریں

source: Please log in again
ur: براہ کرم دوبارہ لاگ اِن کریں

source: Preferences
ur: ترجیحات

# preferencesNote
source: Changes apply immediately
ur: تبدیلیاں فوراً لاگو ہوں گی

source: Profile
ur: پروفائل

# rememberPassword
source: Remember your password?
ur: پاس ورڈ یاد ہے؟

# reenterPasswordHint
source: Re-enter password
ur: پاس ورڈ دوبارہ درج کریں

source: Profile photo update failed
ur: پروفائل تصویر اپ ڈیٹ نہیں ہوسکی

source: Profile photo updated
ur: پروفائل تصویر اپ ڈیٹ ہوگئی

source: Profile updated
ur: پروفائل اپ ڈیٹ ہوگیا

source: Province
ur: صوبہ

# provinceBalochistan
source: Balochistan
ur: بلوچستان

# provinceIct
source: Islamabad Capital Territory
ur: اسلام آباد وفاقی علاقہ

# provinceKp
source: Khyber Pakhtunkhwa
ur: خیبر پختونخوا

# provincePunjab
source: Punjab
ur: پنجاب

# provinceRequired
source: Province is required
ur: صوبہ ضروری ہے

# provinceSindh
source: Sindh
ur: سندھ

source: Quick Actions
ur: فوری اقدامات

# rateExperience
source: Rate your experience
ur: اپنے تجربے کی درجہ بندی کریں

source: Reminders
ur: یاد دہانیاں

# remindersSubtitle
source: Stay on top of deadlines
ur: اہم تاریخیں یاد رکھیں

source: Rename conversation
ur: گفتگو کا نام بدلیں

source: Required
ur: لازمی

# requiredField
source: This field is required
ur: یہ فیلڈ ضروری ہے

source: Reset link sent
ur: ری سیٹ لنک بھیج دیا گیا

source: Reset Password
ur: پاس ورڈ ری سیٹ کریں

# resetPasswordHeadline
source: New Password
ur: نیا پاس ورڈ

# resetPasswordSubtitle
source: Please create a strong password to protect your legal data.
ur: اپنے قانونی ڈیٹا کے تحفظ کے لیے مضبوط پاس ورڈ بنائیں۔

# resetPasswordTitle
source: Reset Password
ur: پاس ورڈ ری سیٹ کریں

source: Reset token
ur: ری سیٹ ٹوکن

source: Rights
ur: حقوق

source: Safe Mode
ur: محفوظ موڈ

# safeModeDescription
source: Hide sensitive content and enable quick exit
ur: حساس مواد چھپائیں اور فوری باہر نکلنے کا اختیار دیں

source: Safe Mode enabled
ur: محفوظ موڈ فعال ہے

source: Safe Mode disabled
ur: محفوظ موڈ غیر فعال ہے

source: Safety
ur: حفاظت

source: Save
ur: محفوظ کریں

source: Saving...
ur: محفوظ کیا جا رہا ہے...

source: Save changes
ur: تبدیلیاں محفوظ کریں

# savedFile
source: Saved {filename}
ur: محفوظ ہوگیا: {filename}

source: Saved Item
ur: محفوظ شدہ آئٹم

# voiceInputSettingsTitle
source: LLM Settings
ur: LLM سیٹنگز

# voiceInputSettingsSubtitle
source: Configure voice provider, chat model, and API keys.
ur: وائس پرووائیڈر، چیٹ ماڈل اور API keys سیٹ کریں۔

# llmVoiceSectionTitle
source: Voice provider
ur: وائس پرووائیڈر

# llmChatSectionTitle
source: Chat LLM
ur: چیٹ LLM

# voiceProviderLabel
source: Voice provider
ur: وائس فراہم کنندہ

# voiceProviderAuto
source: Auto (OpenAI -> OpenRouter -> Groq)
ur: خودکار (OpenAI -> OpenRouter -> Groq)

# voiceProviderAutoNote
source: Select a voice provider and model for transcription.
ur: ٹرانسکرپشن کے لیے وائس پرووائیڈر اور ماڈل منتخب کریں۔

# voiceModelLabel
source: Voice model
ur: وائس ماڈل

# chatProviderLabel
source: Chat provider
ur: چیٹ پرووائیڈر

# chatModelLabel
source: Chat model
ur: چیٹ ماڈل

source: Show API key field
ur: API key فیلڈ دکھائیں

source: Hide API key field
ur: API key فیلڈ چھپائیں

# voiceApiKeyHint
source: Paste your API key
ur: API key یہاں پیسٹ کریں

# voiceSettingsSaved
source: LLM settings saved
ur: LLM سیٹنگز محفوظ ہوگئیں

# voicePermissionDenied
source: Microphone permission denied.
ur: مائیکروفون کی اجازت نہیں ملی۔

# voiceRecordingFailed
source: Unable to record audio. Please try again.
ur: آڈیو ریکارڈ نہیں ہو سکا۔ دوبارہ کوشش کریں۔

# voiceNoSpeechDetected
source: No speech detected. Please try again.
ur: کوئی آواز نہیں ملی۔ دوبارہ کوشش کریں۔

# scheduleDateTime
source: Please select date and time
ur: براہ کرم تاریخ اور وقت منتخب کریں

# securePrivate
source: Secure and Private
ur: محفوظ اور نجی

source: Select Template
ur: ٹیمپلیٹ منتخب کریں

source: Send Message
ur: پیغام بھیجیں

source: Send reset link
ur: ری سیٹ لنک بھیجیں

source: Server error
ur: سرور میں خرابی

source: Sign Up
ur: سائن اپ کریں

source: Sisters
ur: بہنیں

source: Skip
ur: چھوڑیں

source: Something went wrong
ur: کچھ غلط ہوگیا

# splashSubtitle
source: Your legal assistant for everyday needs
ur: روزمرہ قانونی ضروریات کے لیے آپ کا معاون

# splashTitle
source: Legal AI Lawyer
ur: لیگل اے آئی وکیل

source: Suggested lawyers
ur: تجویز کردہ وکلاء

source: Start Chat
ur: چیٹ شروع کریں

# stepWithTitle
source: Step {step}: {title}
ur: مرحلہ {step}: {title}

source: Subject
ur: موضوع

source: Submit feedback
ur: فیڈبیک جمع کریں

source: Support
ur: مدد

source: Support & Feedback
ur: مدد اور فیڈبیک

# supportHintPrefix
source: If you don't receive an email within a few minutes, please check your spam folder or contact
ur: اگر چند منٹ میں ای میل موصول نہ ہو تو براہِ کرم اسپام فولڈر چیک کریں یا

# supportHintSuffix
source: for assistance.
ur: سے مدد لیں۔

source: System
ur: سسٹم

# takePhoto
source: Take a photo
ur: تصویر لیں

source: Tap to view steps
ur: مراحل دیکھنے کے لیے ٹیپ کریں

source: Template
ur: ٹیمپلیٹ

source: Templates
ur: ٹیمپلیٹس

source: Timezone
ur: ٹائم زون

source: Title
ur: عنوان

# titleRequired
source: Title is required
ur: عنوان ضروری ہے

# tokenRequired
source: Reset token is required
ur: ری سیٹ ٹوکن ضروری ہے

source: Too many requests
ur: بہت زیادہ درخواستیں

source: Tools
ur: ٹولز

source: Total siblings
ur: کل بہن بھائی

source: Type your question
ur: اپنا سوال لکھیں

source: Undo
ur: واپس لیں

source: Unexpected error
ur: غیر متوقع خرابی

source: Unknown
ur: نامعلوم

source: Update Password
ur: پاس ورڈ اپ ڈیٹ کریں

source: Uploading...
ur: اپ لوڈ ہو رہا ہے...

# userInitialFallback
source: U
ur: م

# validNumber
source: Enter a valid number
ur: درست نمبر درج کریں

source: Verification token
ur: تصدیقی ٹوکن

source: Verify Email
ur: ای میل کی تصدیق کریں

source: Welcome back
ur: دوبارہ خوش آمدید

# dashboardItemsCount
source: {count} items
ur: {count} ?????

# timeMinutesAgo
source: {count} min ago
ur: {count} ??? ????

# timeHoursAgo
source: {count} hours ago
ur: {count} ????? ????

# timeDaysAgo
source: {count} days ago
ur: {count} ?? ????

# policeService
source: Police ({number})
ur: ????? ({number})

# womenHelplineService
source: Women ({number})
ur: ?????? ({number})

# cyberCrimeService
source: Cyber Crime ({number})
ur: ????? ????? ({number})

# rescueService
source: Rescue ({number})
ur: ?????? ({number})

# adminConsoleTitle
source: Admin Console
ur: ایڈمن کنسول

# adminLabel
source: Admin
ur: ایڈمن

# adminNavOverview
source: Overview
ur: جائزہ

# adminNavUsers
source: Users
ur: صارفین

# adminNavLawyers
source: Lawyers
ur: وکلاء

# adminNavKnowledge
source: Knowledge
ur: علمی مواد

# adminNavRights
source: Rights
ur: حقوق

# adminNavTemplates
source: Templates
ur: ٹیمپلیٹس

# adminNavPathways
source: Pathways
ur: راستے

# adminNavChecklists
source: Checklists
ur: چیک لسٹس

# adminNavContact
source: Contact
ur: رابطہ

# adminNavFeedback
source: Feedback
ur: فیڈبیک

# adminNavSettings
source: Settings
ur: سیٹنگز

# adminNavDashboard
source: Dashboard
ur: ڈیش بورڈ

# adminConfiguration
source: Configuration
ur: کنفیگریشن

# adminRoleSeniorLegalAdministrator
source: Senior Legal Administrator
ur: سینئر لیگل ایڈمنسٹریٹر

# adminRoleSystemAdministrator
source: System Administrator
ur: سسٹم ایڈمنسٹریٹر

# adminUsersSubtitle
source: Control access and manage user accounts
ur: رسائی کنٹرول کریں اور صارف اکاؤنٹس مینیج کریں

# adminNewUser
source: New User
ur: نیا صارف

# adminNoUsersTitle
source: No users yet
ur: ابھی کوئی صارف نہیں

# adminNoUsersMessage
source: Create the first user to get started.
ur: شروع کرنے کے لیے پہلا صارف بنائیں۔

# adminUnnamedUser
source: Unnamed User
ur: بے نام صارف

# adminRoleAdmin
source: Admin
ur: ایڈمن

# adminStatusDeleted
source: Deleted
ur: حذف شدہ

# adminCreateUser
source: Create User
ur: صارف بنائیں

# adminEditUser
source: Edit User
ur: صارف میں ترمیم کریں

# adminNewPasswordOptional
source: New Password (optional)
ur: نیا پاس ورڈ (اختیاری)

# adminAllFieldsRequired
source: All fields are required
ur: تمام خانے لازمی ہیں

# adminPasswordRuleStrict
source: Password must be 8+ chars with uppercase, lowercase, and a special character
ur: پاس ورڈ کم از کم 8 حروف، بڑے اور چھوٹے حروف اور ایک خاص علامت پر مشتمل ہونا چاہیے

# adminNamePhoneRequired
source: Name and phone are required
ur: نام اور فون لازمی ہیں

# adminDeleteUserTitle
source: Delete User
ur: صارف حذف کریں

# adminDeleteUserConfirm
source: Are you sure you want to delete this user?
ur: کیا آپ واقعی اس صارف کو حذف کرنا چاہتے ہیں؟

# adminLawyersSubtitle
source: Manage verified lawyers and profiles
ur: تصدیق شدہ وکلاء اور پروفائلز مینیج کریں

# adminNewLawyer
source: New Lawyer
ur: نیا وکیل

# adminNoLawyersTitle
source: No lawyers yet
ur: ابھی کوئی وکیل نہیں

# adminNoLawyersMessage
source: Add lawyers to populate the directory.
ur: ڈائریکٹری بھرنے کے لیے وکلاء شامل کریں۔

# adminStatusActive
source: Active
ur: فعال

# adminStatusInactive
source: Inactive
ur: غیر فعال

# adminDeactivate
source: Deactivate
ur: غیر فعال کریں

# adminCreateLawyer
source: Create Lawyer
ur: وکیل بنائیں

# adminEditLawyer
source: Edit Lawyer
ur: وکیل میں ترمیم کریں

# adminSelectImage
source: Select Image
ur: تصویر منتخب کریں

# adminChangeImage
source: Change Image
ur: تصویر تبدیل کریں

# adminProfilePictureRequired
source: Profile picture is required
ur: پروفائل تصویر لازمی ہے

# adminDeactivateLawyerTitle
source: Deactivate Lawyer
ur: وکیل غیر فعال کریں

# adminDeactivateLawyerConfirm
source: Are you sure you want to deactivate this lawyer?
ur: کیا آپ واقعی اس وکیل کو غیر فعال کرنا چاہتے ہیں؟

# adminImageTypeNotAllowed
source: Only JPG and PNG images are allowed
ur: صرف JPG اور PNG تصاویر کی اجازت ہے

# adminImageTooLarge
source: Image too large (max 5MB)
ur: تصویر بہت بڑی ہے (زیادہ سے زیادہ 5MB)

# adminImageDataMissing
source: Image data is missing
ur: تصویر کا ڈیٹا موجود نہیں

# adminKnowledgeBase
source: Knowledge Base
ur: علمی بنیاد

# adminKnowledgeSubtitle
source: Manage RAG sources and ingestion pipeline
ur: RAG ذرائع اور انجیشن پائپ لائن مینیج کریں

# adminAddSource
source: Add Source
ur: ماخذ شامل کریں

# adminNoSourcesTitle
source: No sources yet
ur: ابھی کوئی ماخذ نہیں

# adminNoSourcesMessage
source: Add a URL or upload a file to start ingestion.
ur: انجیشن شروع کرنے کے لیے یو آر ایل شامل کریں یا فائل اپ لوڈ کریں۔

# adminAddKnowledgeSource
source: Add Knowledge Source
ur: علمی ماخذ شامل کریں

# adminUrlSource
source: URL Source
ur: یو آر ایل ماخذ

# adminFileUpload
source: File Upload
ur: فائل اپ لوڈ

# adminUrl
source: URL
ur: یو آر ایل

# adminSelectFile
source: Select File
ur: فائل منتخب کریں

# adminChangeFile
source: Change File
ur: فائل تبدیل کریں

# adminTitleUrlRequired
source: Title and URL are required
ur: عنوان اور یو آر ایل لازمی ہیں

# adminInvalidUrl
source: Enter a valid URL
ur: درست یو آر ایل درج کریں

# adminFileRequired
source: File is required
ur: فائل لازمی ہے

# adminIngest
source: Ingest
ur: انجیسٹ کریں

# adminStatusDone
source: Done
ur: مکمل

# adminStatusFailed
source: Failed
ur: ناکام

# adminStatusProcessing
source: Processing
ur: پروسیسنگ

# adminFileTypeNotAllowed
source: File type not allowed
ur: فائل کی قسم کی اجازت نہیں

# adminFileTooLarge
source: File too large (max 30MB)
ur: فائل بہت بڑی ہے (زیادہ سے زیادہ 30MB)

# adminFileDataMissing
source: File data is missing
ur: فائل ڈیٹا موجود نہیں

# adminRightsSubtitle
source: Manage legal rights library
ur: قانونی حقوق کی لائبریری مینیج کریں

# adminNewRight
source: New Right
ur: نیا حق

# adminNoRightsTitle
source: No rights yet
ur: ابھی کوئی حق نہیں

# adminNoRightsMessage
source: Create the first right to populate the library.
ur: لائبریری بھرنے کے لیے پہلا حق بنائیں۔

# adminCreateRight
source: Create Right
ur: حق بنائیں

# adminEditRight
source: Edit Right
ur: حق میں ترمیم کریں

# adminTopic
source: Topic
ur: موضوع

# adminBody
source: Body
ur: متن

# adminTagsCommaSeparated
source: Tags (comma separated)
ur: ٹیگز (کاما سے جدا)

# adminTopicBodyRequired
source: Topic and body are required
ur: موضوع اور متن لازمی ہیں

# adminDeleteRightTitle
source: Delete Right
ur: حق حذف کریں

# adminDeleteRightConfirm
source: Are you sure you want to delete this right?
ur: کیا آپ واقعی اس حق کو حذف کرنا چاہتے ہیں؟

# adminTemplatesSubtitle
source: Manage document templates
ur: دستاویز ٹیمپلیٹس مینیج کریں

# adminNewTemplate
source: New Template
ur: نیا ٹیمپلیٹ

# adminNoTemplatesTitle
source: No templates yet
ur: ابھی کوئی ٹیمپلیٹ نہیں

# adminNoTemplatesMessage
source: Create the first template for users.
ur: صارفین کے لیے پہلا ٹیمپلیٹ بنائیں۔

# adminCreateTemplate
source: Create Template
ur: ٹیمپلیٹ بنائیں

# adminEditTemplate
source: Edit Template
ur: ٹیمپلیٹ میں ترمیم کریں

# adminDescription
source: Description
ur: تفصیل

# adminTitleBodyRequired
source: Title and body are required
ur: عنوان اور متن لازمی ہیں

# adminDeleteTemplateTitle
source: Delete Template
ur: ٹیمپلیٹ حذف کریں

# adminDeleteTemplateConfirm
source: Are you sure you want to delete this template?
ur: کیا آپ واقعی اس ٹیمپلیٹ کو حذف کرنا چاہتے ہیں؟

# adminPathwaysSubtitle
source: Manage step-by-step legal guidance
ur: مرحلہ وار قانونی رہنمائی مینیج کریں

# adminNewPathway
source: New Pathway
ur: نیا راستہ

# adminNoPathwaysTitle
source: No pathways yet
ur: ابھی کوئی راستہ نہیں

# adminNoPathwaysMessage
source: Create structured guidance for users.
ur: صارفین کے لیے ساختہ رہنمائی بنائیں۔

# adminCreatePathway
source: Create Pathway
ur: راستہ بنائیں

# adminEditPathway
source: Edit Pathway
ur: راستہ میں ترمیم کریں

# adminSummary
source: Summary
ur: خلاصہ

# adminStepsJson
source: Steps (JSON list)
ur: مراحل (JSON فہرست)

# adminStepsMustBeList
source: Steps must be a list
ur: مراحل فہرست کی صورت میں ہونے چاہئیں

# adminInvalidStepsJson
source: Invalid steps JSON
ur: مراحل کا JSON غلط ہے

# adminDeletePathwayTitle
source: Delete Pathway
ur: راستہ حذف کریں

# adminDeletePathwayConfirm
source: Are you sure you want to delete this pathway?
ur: کیا آپ واقعی اس راستے کو حذف کرنا چاہتے ہیں؟

# adminChecklistsSubtitle
source: Manage checklist categories and items
ur: چیک لسٹ کیٹیگریز اور آئٹمز مینیج کریں

# adminNewCategory
source: New Category
ur: نئی کیٹیگری

# adminNoCategoriesTitle
source: No categories yet
ur: ابھی کوئی کیٹیگری نہیں

# adminNoCategoriesMessage
source: Create categories to group checklist items.
ur: چیک لسٹ آئٹمز کو گروپ کرنے کے لیے کیٹیگریز بنائیں۔

# adminOrderValue
source: Order {order}
ur: ترتیب {order}
