Repository: raheel-dev-ops/Legal_Lawyer_AI
Catalog: legalai-frontend/lib/l10n/app_*.arb
Languages: ur

# adminManageItems
source: Manage Items
ur: آئٹمز مینیج کریں

# adminCreateCategory
source: Create Category
ur: کیٹیگری بنائیں

# adminEditCategory
source: Edit Category
ur: کیٹیگری میں ترمیم کریں

# adminIconOptional
source: Icon (optional)
ur: آئیکن (اختیاری)

# adminOrderLabel
source: Order
ur: ترتیب

# adminDeleteCategoryTitle
source: Delete Category
ur: کیٹیگری حذف کریں

# adminDeleteCategoryConfirm
source: Are you sure you want to delete this category?
ur: کیا آپ واقعی اس کیٹیگری کو حذف کرنا چاہتے ہیں؟

# adminChecklistItemsTitle
source: Checklist Items
ur: چیک لسٹ آئٹمز

# adminInvalidCategory
source: Invalid category
ur: غلط کیٹیگری

# adminMissingCategory
source: Missing category
ur: کیٹیگری موجود نہیں

# adminSelectCategoryMessage
source: Select a checklist category to view its items.
ur: آئٹمز دیکھنے کے لیے چیک لسٹ کیٹیگری منتخب کریں۔

# adminItemsSubtitle
source: Manage item ordering and requirements
ur: آئٹمز کی ترتیب اور ضروریات مینیج کریں

# adminNewItem
source: New Item
ur: نیا آئٹم

# adminNoItemsTitle
source: No items yet
ur: ابھی کوئی آئٹم نہیں

# adminNoItemsMessage
source: Add checklist items for this category.
ur: اس کیٹیگری کے لیے چیک لسٹ آئٹمز شامل کریں۔

# adminOrderRequiredValue
source: Order {order} - Required {required}
ur: ترتیب {order} - لازمی {required}

# adminCreateItem
source: Create Item
ur: آئٹم بنائیں

# adminEditItem
source: Edit Item
ur: آئٹم میں ترمیم کریں

# adminTextLabel
source: Text
ur: متن

# adminTextRequired
source: Text is required
ur: متن لازمی ہے

# adminDeleteItemTitle
source: Delete Item
ur: آئٹم حذف کریں

# adminDeleteItemConfirm
source: Are you sure you want to delete this item?
ur: کیا آپ واقعی اس آئٹم کو حذف کرنا چاہتے ہیں؟

# adminContactMessages
source: Contact Messages
ur: رابطہ پیغامات

# adminContactSubtitle
source: Review and respond to user inquiries
ur: صارفین کی پوچھ گچھ کا جائزہ لیں اور جواب دیں

# adminNoMessagesTitle
source: No messages yet
ur: ابھی کوئی پیغام نہیں

# adminNoMessagesMessage
source: Incoming support requests will appear here.
ur: آنے والی سپورٹ درخواستیں یہاں دکھائی دیں گی۔

# adminNoSubject
source: No subject
ur: کوئی موضوع نہیں

# adminMessageDetailTitle
source: Message Detail
ur: پیغام کی تفصیل

# adminMessageDetailSubtitle
source: Review the full support request
ur: مکمل سپورٹ درخواست کا جائزہ لیں

# adminFeedbackSubtitle
source: Monitor sentiment and user ratings
ur: جذباتی رجحان اور ریٹنگز پر نظر رکھیں

# adminFeedbackManagementTitle
source: Feedback Management
ur: فیڈبیک مینجمنٹ

# adminFeedbackManagementSubtitle
source: Review and respond to user feedback
ur: صارفین کے فیڈبیک کا جائزہ لیں اور جواب دیں

# adminUnableToLoadFeedback
source: Unable to load feedback
ur: فیڈبیک لوڈ نہیں ہو سکا

# adminNoFeedbackTitle
source: No feedback yet
ur: ابھی کوئی فیڈبیک نہیں

# adminNoFeedbackMessage
source: Ratings and comments will appear here.
ur: ریٹنگز اور تبصرے یہاں ظاہر ہوں گے۔

# adminSortLabel
source: Sort:
ur: ترتیب:

# adminNewest
source: Newest
ur: تازہ ترین

# adminOldest
source: Oldest
ur: پرانا

# adminRatingLabel
source: Rating:
ur: ریٹنگ:

# adminStatusLabel
source: Status:
ur: حالت:

# adminUnread
source: Unread
ur: ان پڑھا

# adminRead
source: Read
ur: پڑھا ہوا

# adminAvgRating
source: Avg Rating
ur: اوسط ریٹنگ

# adminTotalFeedback
source: Total Feedback
ur: کل فیڈبیک

# adminUpdatingSummary
source: Updating summary...
ur: خلاصہ اپ ڈیٹ ہو رہا ہے...

# adminUserNumber
source: User #{id}
ur: صارف #{id}

# adminUserBadge
source: U#
ur: ص#

# adminNoCommentProvided
source: No comment provided.
ur: کوئی تبصرہ موجود نہیں۔

# adminLoadMoreFeedback
source: Load More Feedback
ur: مزید فیڈبیک لوڈ کریں

# adminFeedbackDetailTitle
source: Feedback Detail
ur: فیڈبیک تفصیل

# adminFeedbackDetailSubtitle
source: Full response from the user
ur: صارف کی مکمل رائے

# adminUserIdLabel
source: User ID
ur: صارف آئی ڈی

# adminCommentLabel
source: Comment
ur: تبصرہ

# adminTotalUsers
source: Total Users
ur: کل صارفین

# adminTotalLawyers
source: Total Lawyers
ur: کل وکلاء

# adminTotalFeedbacks
source: Total Feedbacks
ur: کل فیڈبیک

# adminManagementHub
source: MANAGEMENT HUB
ur: مینجمنٹ ہب

# adminRagQualityOverview
source: RAG Quality Overview
ur: RAG کوالٹی جائزہ

# adminRagEvaluationLog
source: RAG EVALUATION LOG
ur: RAG ایویلیوایشن لاگ

# adminDecisionBreakdown
source: DECISION BREAKDOWN
ur: فیصلہ وار تقسیم

# adminDecisionAnswer
source: Answer
ur: جواب

# adminDecisionDomain
source: Domain
ur: ڈومین

# adminDecisionNoHits
source: No Hits
ur: کوئی ہٹ نہیں

# adminDecisionOutOfDomain
source: Out of Domain
ur: ڈومین سے باہر

# adminLatency
source: Latency
ur: تاخیر

# adminAccuracy
source: Accuracy
ur: درستی

# adminDistance
source: Distance
ur: فاصلہ

# adminTokenUsage
source: TOKEN USAGE
ur: ٹوکَن استعمال

# adminLiveStats
source: LIVE STATS
ur: براہِ راست اعداد

# adminTotalUsed
source: Total Used
ur: کل استعمال

# adminAvgQuery
source: Avg Query
ur: اوسط سوال

# adminRagLogsTitle
source: RAG Evaluation Logs
ur: RAG ایویلیوایشن لاگز

# adminRagLogsSubtitle
source: Inspect retrieval quality, latency, and outcomes
ur: ریکال، تاخیر اور نتائج کا جائزہ لیں

# adminUnableToLoadLogs
source: Unable to load logs
ur: لاگز لوڈ نہیں ہو سکے

# adminNoLogsTitle
source: No evaluation logs
ur: کوئی ایویلیوایشن لاگ نہیں

# adminNoLogsMessage
source: No logs found for the selected filters.
ur: منتخب فلٹرز کے لیے کوئی لاگ نہیں ملا۔

# adminDaysLabel
source: Days
ur: دن

# adminDecisionLabel
source: Decision
ur: فیصلہ

# adminInDomainLabel
source: In Domain
ur: ڈومین میں

# adminOutOfDomainLabel
source: Out of Domain
ur: ڈومین سے باہر

# adminSafeModeLabel
source: Safe Mode
ur: محفوظ موڈ

# adminErrorsLabel
source: Errors
ur: غلطیاں

# adminOnlyErrors
source: Only Errors
ur: صرف غلطیاں

# adminMinTimeLabel
source: Min Time
ur: کم از کم وقت

# adminOn
source: On
ur: آن

# adminOff
source: Off
ur: آف

# adminNoQuestionText
source: No question text
ur: سوال کا متن موجود نہیں

# adminSafeModeOn
source: Safe Mode On
ur: محفوظ موڈ آن

# adminSafeModeOff
source: Safe Mode Off
ur: محفوظ موڈ آف

# adminErrorLabel
source: Error
ur: غلطی

# adminContextsLabel
source: Contexts
ur: کانٹیکسٹ

# adminTokensLabel
source: Tokens
ur: ٹوکَنز

# adminLoadMoreLogs
source: Load More Logs
ur: مزید لاگز لوڈ کریں

# adminQueryDetailTitle
source: Query Detail
ur: کوئری تفصیل

# adminQueryDetailSubtitle
source: Full trace of the selected request
ur: منتخب درخواست کی مکمل تفصیل

# adminCreatedAtLabel
source: Created At
ur: تخلیق کی تاریخ

# adminConversationIdLabel
source: Conversation ID
ur: گفتگو آئی ڈی

# adminNewConversationLabel
source: New Conversation
ur: نئی گفتگو

# adminQuestionLabel
source: Question
ur: سوال

# adminLengthLabel
source: Length
ur: لمبائی

# adminAnswerLabel
source: Answer
ur: جواب

# adminUsedFallbackLabel
source: Used Fallback
ur: فالبیک استعمال ہوا

# adminDisclaimerAddedLabel
source: Disclaimer Added
ur: ڈسکلیمر شامل کیا گیا

# adminRetrievalLabel
source: Retrieval
ur: ریکال

# adminThresholdLabel
source: Threshold
ur: تھریش ہولڈ

# adminBestDistanceLabel
source: Best Distance
ur: بہترین فاصلہ

# adminContextsFoundLabel
source: Contexts Found
ur: ملے ہوئے کانٹیکسٹس

# adminContextsUsedLabel
source: Contexts Used
ur: استعمال شدہ کانٹیکسٹس

# adminChunkIdsLabel
source: Chunk IDs
ur: چنک آئی ڈیز

# adminSourcesLabel
source: Sources
ur: ذرائع

# adminPerformanceLabel
source: Performance
ur: کارکردگی

# adminTotalTimeMsLabel
source: Total Time (ms)
ur: کل وقت (ms)

# adminEmbeddingTimeMsLabel
source: Embedding Time (ms)
ur: ایمبیڈنگ وقت (ms)

# adminLlmTimeMsLabel
source: LLM Time (ms)
ur: LLM وقت (ms)

# adminPromptTokensLabel
source: Prompt Tokens
ur: پرومپٹ ٹوکَنز

# adminCompletionTokensLabel
source: Completion Tokens
ur: کمپلِیشن ٹوکَنز

# adminTotalTokensLabel
source: Total Tokens
ur: کل ٹوکَنز

# adminModelsLabel
source: Models
ur: ماڈلز

# adminEmbeddingModelLabel
source: Embedding Model
ur: ایمبیڈنگ ماڈل

# adminEmbeddingDimensionLabel
source: Embedding Dimension
ur: ایمبیڈنگ ڈائمینشن

# adminChatModelLabel
source: Chat Model
ur: چیٹ ماڈل

# adminTypeLabel
source: Type
ur: قسم

source: Yes
ur: ہاں

source: No
ur: نہیں

source: All
ur: سب

source: None
ur: کوئی نہیں

source: Apply
ur: لاگو کریں

source: Notifications
ur: نوٹیفکیشنز

source: Notification Preferences
ur: نوٹیفکیشن ترجیحات

source: Content updates
ur: مواد کی تازہ کاریاں

source: Refresh content
ur: مواد تازہ کریں

# refreshContentSubtitle
source: Fetch the latest rights, templates, and pathways for offline use.
ur: آف لائن استعمال کے لیے حقوق، ٹیمپلیٹس اور راستے تازہ کریں۔

# refreshContentSuccess
source: Content updated.
ur: مواد تازہ ہو گیا۔

# refreshContentFailed
source: Unable to refresh content.
ur: مواد تازہ نہیں ہو سکا۔

# refreshContentOffline
source: No internet connection.
ur: انٹرنیٹ کنکشن موجود نہیں۔

source: Lawyer updates
ur: وکیل کی تازہ کاریاں

source: Reminder notifications
ur: یاد دہانی کی نوٹیفکیشنز

source: Recent notifications
ur: حالیہ نوٹیفکیشنز

# noNotifications
source: No notifications yet
ur: ابھی کوئی نوٹیفکیشن نہیں
